Repository: johnvibe56/Rivo
Catalog: lib/l10n/app_*.arb
Languages: he

# appTitle
source: RIVO
he: ריבו

source: Login
he: התחברות

source: Sign Up
he: הרשמה

# welcome
source: Welcome to RIVO
he: ברוכים הבאים לריבו

source: Welcome to Rivo
he: ברוכים הבאים לריבו

# onboardingWelcomeDescription
source: Discover amazing products and connect with sellers in your area
he: גלה מוצרים מדהימים והתחבר למוכרים באזורך

# onboardingBuySellTitle
source: Buy & Sell with Ease
he: קנה ומכור בקלות

# onboardingBuySellDescription
source: List items for sale or find great deals near you
he: פרסם פריטים למכירה או מצא עסקאות מעולות בסביבתך

# onboardingSafeTitle
source: Safe & Secure
he: בטוח ומאובטח

# onboardingSafeDescription
source: Chat with sellers and buyers in a secure environment
he: צ'וטט עם מוכרים וקונים בסביבה מאובטחת

source: Skip
he: דלג

source: Next
he: הבא

source: Get Started
he: התחל עכשיו

source: Already have an account? Sign In
he: כבר יש לך חשבון? היכנס

source: Products
he: מוצרים

source: Profile
he: פרופיל

source: Settings
he: הגדרות

source: Language
he: שפה

# validationRequired
source: This field is required
he: שדה חובה

# validationEmailInvalid
source: Please enter a valid email address
he: נא להזין כתובת אימייל תקינה

# validationPasswordTooShort
source: Password must be at least 8 characters long
he: הסיסמה חייבת להכיל לפחות 8 תווים

# validationBioTooLong
source: Bio cannot be longer than 200 characters
he: הביוגרפיה לא יכולה להכיל יותר מ-200 תווים

# unsavedChanges
source: You have unsaved changes
he: יש לך שינויים שלא נשמרו

# discardChangesConfirmation
source: Discard changes?
he: לבטל את השינויים?

source: Select Image
he: בחר תמונה

# validationUsernameTooShort
source: Username must be at least 3 characters long
he: שם המשתמש חייב להכיל לפחות 3 תווים

# validationUsernameInvalid
source: Username can only contain letters, numbers and underscores
he: שם משתמש יכול להכיל רק אותיות, מספרים וקו תחתון

# validationPriceInvalid
source: Please enter a valid price (e.g., 10.99)
he: נא להזין מחיר תקין (לדוגמה: 10.99)

source: Continue with Google
he: המשך עם גוגל

source: Sign In
he: התחברות

source: Forgot Password?
he: שכחת סיסמה?

source: Don't have an account?
he: אין לך חשבון?

source: Create Account
he: צור חשבון

source: Already have an account?
he: כבר יש לך חשבון?

# noAccountFoundWithEmail
source: No account found with this email address.
he: לא נמצא חשבון עם כתובת אימייל זו.

# networkError
source: Network error. Please check your connection and try again.
he: שגיאת רשת. אנא בדוק את החיבור שלך ונסה שוב.

source: Send Reset Link
he: שלח קישור לאיפוס סיסמה

source: Check Your Email
he: בדוק את האימייל שלך

# resetPasswordEmailSent
source: We've sent you an email with instructions to reset your password. If you don't see it, check your spam folder.
he: שלחנו לך הודעת אימייל עם הוראות לאיפוס הסיסמה שלך. אם אינך רואה אותה, בדוק בתיקיית הספאם שלך.

source: Back to Sign In
he: חזור להתחברות

source: Product Feed
he: פיד מוצרים

source: Refresh
he: רענן

source: Error loading products
he: שגיאה בטעינת מוצרים

source: Retry
he: נסה שוב

source: Product Details
he: פרטי מוצר

# productNoLongerAvailable
source: This product is no longer available
he: מוצר זה אינו זמין יותר

# productNoLongerExists
source: This product no longer exists
he: המוצר אינו קיים יותר

source: Failed to load product
he: שגיאה בטעינת המוצר

source: Unexpected Error
he: שגיאה בלתי צפויה

source: Description
he: תיאור

source: Seller Information
he: מידע על המוכר

source: Chat
he: צ'אט

source: Edit Profile
he: עריכת פרופיל

source: Error loading profile
he: שגיאה בטעינת הפרופיל

source: Failed to load profile
he: שגיאה בטעינת הפרופיל

source: Failed to load products
he: שגיאה בטעינת המוצרים

source: Added to cart
he: נוסף לסל

source: View Cart
he: צפה בסל

source: Failed to add to cart
he: שגיאה בהוספה לסל

source: Failed to pick image
he: שגיאה בבחירת תמונה

source: Profile updated successfully
he: הפרופיל עודכן בהצלחה

source: Failed to update profile
he: שגיאה בעדכון הפרופיל

source: Change Photo
he: שנה תמונה

source: Username
he: שם משתמש

source: Enter your username
he: הזן שם משתמש

source: Username already taken
he: שם המשתמש תפוס

# pleaseEnterUsername
source: Please enter a username
he: אנא הזן שם משתמש

source: Username must be at least 3 characters
he: שם המשתמש חייב להכיל לפחות 3 תווים

source: Bio
he: אודות

source: Tell us about yourself
he: ספר/י לנו על עצמך

source: Save Changes
he: שמור שינויים

source: Error signing out
he: שגיאה בהתנתקות

source: Product deleted
he: המוצר נמחק בהצלחה

source: Failed to delete product
he: שגיאה במחיקת המוצר

# errorDeletingProduct
source: An unexpected error occurred while deleting the product
he: שגיאה במחיקת המוצר

source: Delete Product
he: מחיקת מוצר

# confirmDeleteProduct
source: Are you sure you want to delete this product? This action cannot be undone.
he: האם אתה בטוח שברצונך למחוק מוצר זה? פעולה זו אינה ניתנת לביטול.

source: Cancel
he: ביטול

source: Delete
he: מחק

source: Failed to open edit profile
he: שגיאה בפתיחת עריכת פרופיל

source: My Profile
he: הפרופיל שלי

source: My Purchases
he: הרכישות שלי

source: Sign Out
he: התנתק

source: No products found
he: לא נמצאו מוצרים

source: My Wishlist
he: המועדפים שלי

# signInToViewWishlist
source: Please sign in to view your wishlist
he: אנא היכנס לחשבון כדי לצפות במועדפים שלך

# wishlistEmpty
source: No saved items yet
he: אין עדיין פריטים שמורים

source: Continue Shopping
he: המשך בקניות

source: Add to Cart
he: הוספה לעגלה

source: Remove from Wishlist
he: הסרה מרשימת המשאלות

source: Remove
he: הסר

source: Failed to load wishlist
he: שגיאה בטעינת המועדפים

# productUnavailable
source: Product no longer available
he: המוצר כבר לא זמין

source: Your Cart
he: הסל שלך

source: Your cart is empty
he: הסל שלך ריק

source: Total
he: סך הכל

source: Checkout
he: לתשלום

source: Checkout simulation complete!
he: סימולציית התשלום הושלמה!

source: Product deleted successfully
he: המוצר נמחק בהצלחה

# unexpectedErrorTryAgain
source: An unexpected error occurred. Please try again.
he: אירעה שגיאה בלתי צפויה. אנא נסה שוב.

# pleaseLoginToPurchase
source: Please log in to make a purchase
he: אנא התחבר כדי לבצע רכישה

# alreadyPurchasedItem
source: You have already purchased this item!
he: כבר רכשת את הפריט הזה!

source: Purchase successful!
he: הרכישה בוצעה בהצלחה!

source: Purchase failed
he: הרכישה נכשלה

source: Error
he: שגיאה

source: Unknown error
he: שגיאה לא ידועה

# unexpectedErrorOccurred
source: An unexpected error occurred
he: אירעה שגיאה בלתי צפויה

source: Buy Now
he: קנה עכשיו

source: Welcome Back
he: ברוך שובך

# signInToContinue
source: Sign in to continue to Rivo
he: התחבר כדי להמשיך ל-Rivo

source: Email
he: אימייל

source: Enter your email
he: הזן את האימייל שלך

source: Password
he: סיסמה

source: Enter your password
he: הזן את הסיסמה שלך

source: OR
he: או

# invalidEmailOrPassword
source: Invalid email or password. Please try again.
he: אימייל או סיסמה שגויים. אנא נסה שוב.

# verifyEmailBeforeSignIn
source: Please verify your email before signing in. Check your inbox for a verification link.
he: אנא אשר את האימייל שלך לפני ההתחברות. בדוק את תיבת הדואר הנכנס שלך לקבלת קישור האימות.

# networkErrorTryAgain
source: Network error. Please check your connection and try again.
he: שגיאת רשת. אנא בדוק את החיבור שלך ונסה שוב.

# noAccountFoundSignUp
source: No account found with this email. Please sign up first.
he: לא נמצא חשבון עם האימייל הזה. אנא הירשם קודם.

# signInCanceled
source: Sign in was canceled. Please try again.
he: ההתחברות בוטלה. אנא נסה שוב.

# googleSignInFailed
source: Failed to sign in with Google. Please try again.
he: ההתחברות עם נכשלה. אנא נסה שוב.

source: Create an Account
he: יצירת חשבון

# fillInYourDetails
source: Fill in your details to get started
he: מלא את הפרטים שלך כדי להתחיל

source: Full Name
he: שם מלא

source: Enter your full name
he: הזן את שמך המלא

# titleLabel
source: Title
he: כותרת

# descriptionLabel
source: Description
he: תיאור

# priceLabel
source: Price
he: מחיר

# tapToAddImage
source: Tap to add an image
he: הקש להוספת תמונה

source: Gallery
he: גלריה

source: Camera
he: מצלמה

source: Uploading...
he: מעלה...

# uploadSuccessTitle
source: Success!
he: ההעלאה הצליחה!

# uploadSuccessMessage
source: Your product has been uploaded successfully.
he: המוצר שלך הועלה בהצלחה ונראה כעת למשתמשים אחרים.

source: View Product
he: צפה במוצר

# uploadErrorTitle
source: Upload Failed
he: העלאה נכשלה

# uploadErrorMessage
source: There was an error uploading your product. Please try again.
he: אירעה שגיאה בהעלאת המוצר. נסה שוב.

# titleRequired
source: Title is required
he: נדרש למלא כותרת

# descriptionRequired
source: Description is required
he: נדרש למלא תיאור

# priceRequired
source: Price is required
he: נדרש למלא מחיר

# invalidPrice
source: Please enter a valid price
he: אנא הזן מחיר תקין

# imageRequired
source: Please select an image
he: אנא בחר תמונה

source: Choose a username
he: בחר שם משתמש

# usernameAvailable
source: Username is available!
he: שם המשתמש זמין!

# usernameTaken
source: This username is already taken
he: שם המשתמש הזה כבר תפוס

# errorCheckingUsername
source: Error checking username availability
he: שגיאה בבדיקת זמינות שם המשתמש

source: Create a strong password
he: צור סיסמה חזקה

source: Back
he: חזרה

# searchHint
source: Search items, brands and categories
he: חפש פריטים, מותגים וקטגוריות

source: Sort
he: מיון

source: Filter
he: סינון

source: Follow
he: עקוב

source: Following
he: עוקב

# unfollowedSeller
source: You have unfollowed this seller
he: ביטלת את המעקב אחרי מוכר זה

# followedSeller
source: You are now following this seller
he: אתה עוקב כעת אחרי מוכר זה

source: No internet connection
he: אין חיבור לאינטרנט

source: Please sign in to continue
he: אנא התחבר כדי להמשיך

source: Add to wishlist
he: הוסף למועדפים

source: Added to wishlist
he: נוסף למועדפים

source: Removed from wishlist
he: הוסר מהמועדפים

source: Share
he: שתף

source: Like
he: אהבתי

source: Unlike
he: ביטול אהבה

source: Save
he: שמור

source: Unsave
he: בטל שמירה

source: User
he: משתמש

source: Add New Product
he: הוספת מוצר חדש

source: Upload Product
he: העלאת מוצר

source: Title
he: כותרת

source: Price
he: מחיר

# fieldRequired
source: This field is required
he: שדה חובה

source: Upload Failed
he: העלאה נכשלה

# somethingWentWrong
source: Something went wrong. Please try again.
he: משהו השתבש

source: Posted
he: פורסם

source: Failed to like product
he: שגיאה באהבת המוצר

source: Failed to save product
he: שגיאה בשמירת המוצר

source: Just now
he: כרגע

# minutesAgo
source: {minutes, plural, one{1 minute ago} other{{minutes} minutes ago}}
he: לפני {minutes, plural, one{דקה} two{שתי דקות} many{דקות} other{{minutes} דקות}}

# hoursAgo
source: {hours, plural, one{1 hour ago} other{{hours} hours ago}}
he: לפני {hours, plural, one{שעה} two{שעתיים} many{שעות} other{{hours} שעות}}

# daysAgo
source: {days, plural, one{1 day ago} other{{days} days ago}}
he: לפני {days, plural, one{יום} two{יומיים} many{ימים} other{{days} ימים}}

# monthsAgo
source: {months, plural, one{1 month ago} other{{months} months ago}}
he: לפני {months, plural, one{חודש} two{חודשיים} many{חודשים} other{{months} חודשים}}

source: Failed to add to wishlist
he: שגיאה בהוספה למועדפים

source: Failed to remove from wishlist
he: שגיאה בהסרה מהמועדפים

source: Confirm Password
he: אשר סיסמה

source: Re-enter your password
he: הזן שוב את הסיסמה שלך

# byCreatingAnAccount
source: By creating an account, you agree to our
he: באמצעות יצירת חשבון, אתה מסכים ל

source: Terms of Service
he: תנאי השירות

source: and
he: ו

source: Privacy Policy
he: מדיניות הפרטיות

source: Reset Password
he: איפוס סיסמה

source: Forgot your password?
he: שכחת את הסיסמה שלך?

# enterYourEmailToResetPassword
source: Enter your email address and we'll send you a link to reset your password.
he: הזן את כתובת האימייל שלך ונשלח לך קישור לאיפוס הסיסמה שלך.

# resetPasswordInstructions
source: We've sent you an email with a link to reset your password. Please check your inbox and follow the instructions. If you don't see the email, check your spam folder.
he: שלחנו לך אימייל עם קישור לאיפוס הסיסמה שלך. אנא בדוק את תיבת הדואר הנכנס שלך ופעל לפי ההוראות. אם אינך רואה את האימייל, בדוק בתיקיית הספאם שלך.

source: Back to Login
he: חזור להתחברות

source: Add your first product
he: הוסף את המוצר הראשון שלך

# searchComingSoon
source: Search functionality coming soon!
he: פונקציונליות החיפוש תגיע בקרוב!

# cartIsEmpty
source: Your cart is empty
he: הסל שלך ריק

# signInToMessage
source: Please sign in to message
he: אנא התחבר כדי לשלוח הודעה

# messagingSeller
source: Messaging seller about {product}
he: שולח הודעה למוכר לגבי {product}

source: Marketplace
he: שוק

# enterTitle
source: Enter product title
he: הזן כותרת למוצר

# enterDescription
source: Enter product description
he: הזן תיאור למוצר

source: Enter price
he: הזן מחיר

# uploadSuccess
source: Upload Successful!
he: העלאה בוצעה בהצלחה!

# productId
source: Product {productId}
he: מוצר {productId}

# productDetailsPlaceholder
source: Product details would appear here
he: כאן יופיעו פרטי המוצר

# addToCartWithStatus
source: Add to Cart - {status}
he: הוספה לעגלה - {status}

# purchaseHistoryTitle
source: My Purchases
he: הרכישות שלי

# dateFormat
source: MMM d, yyyy
he: d בMMM yyyy

# dateFormatShort
source: MM/dd/yyyy
he: dd/MM/yyyy

# purchasedOn
source: Purchased on: {date}
he: נרכש בתאריך: {date}

source: No purchases yet
he: עדיין אין רכישות

# purchasesWillAppearHere
source: Your purchases will appear here
he: הרכישות שלך יופיעו כאן

source: Price not available
he: מחיר לא זמין

# productInfoMissing
source: Product information is missing
he: חסרות פרטי מוצר

source: Unnamed Product
he: מוצר ללא שם

source: Report Issue
he: דווח על בעיה

# unexpectedErrorMessage
source: An unexpected error occurred while loading your purchases.\nPlease try again later.
he: אירעה שגיאה בלתי צפויה בטעינת הרכישות שלך. אנא נסה שוב מאוחר יותר.

# noInternetConnectionMessage
source: No internet connection. Please check your connection and try again.
he: אין חיבור לאינטרנט. אנא בדוק את החיבור שלך ונסה שוב.

# serverErrorMessage
source: Unable to load purchases. Please try again later.
he: לא ניתן לטעון את הרכישות. אנא נסה שוב מאוחר יותר.

# signInToViewHistory
source: Please sign in to view your purchase history
he: אנא התחבר כדי לצפות בהיסטוריית הרכישות שלך

source: Go to Login
he: מעבר להתחברות

source: Loading purchases...
he: טוען רכישות...
